; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image1 - mode
	thermograph2 - mode
	infrared0 - mode
	Star1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 110)
	(= (data Star3 image1) 4)
	(= (data Phenomenon4 image1) 135)
	(= (data Phenomenon5 image1) 160)
	(= (data Planet6 image1) 178)
	(= (data Planet7 image1) 200)
	(= (data Phenomenon8 image1) 268)
	(= (data Planet9 image1) 191)
	(= (data Star10 image1) 35)
	(= (data Star3 thermograph2) 186)
	(= (data Phenomenon4 thermograph2) 33)
	(= (data Phenomenon5 thermograph2) 248)
	(= (data Planet6 thermograph2) 45)
	(= (data Planet7 thermograph2) 148)
	(= (data Phenomenon8 thermograph2) 43)
	(= (data Planet9 thermograph2) 281)
	(= (data Star10 thermograph2) 263)
	(= (data Star3 infrared0) 167)
	(= (data Phenomenon4 infrared0) 4)
	(= (data Phenomenon5 infrared0) 208)
	(= (data Planet6 infrared0) 77)
	(= (data Planet7 infrared0) 140)
	(= (data Phenomenon8 infrared0) 228)
	(= (data Planet9 infrared0) 216)
	(= (data Star10 infrared0) 36)
	(= (slew_time Star1 GroundStation0) 41.69)
	(= (slew_time GroundStation0 Star1) 41.69)
	(= (slew_time GroundStation2 GroundStation0) 30.63)
	(= (slew_time GroundStation0 GroundStation2) 30.63)
	(= (slew_time GroundStation2 Star1) 20.78)
	(= (slew_time Star1 GroundStation2) 20.78)
	(= (slew_time Star3 GroundStation0) 8.362)
	(= (slew_time GroundStation0 Star3) 8.362)
	(= (slew_time Star3 Star1) 46.7)
	(= (slew_time Star1 Star3) 46.7)
	(= (slew_time Star3 GroundStation2) 13.42)
	(= (slew_time GroundStation2 Star3) 13.42)
	(= (slew_time Phenomenon4 GroundStation0) 25.72)
	(= (slew_time GroundStation0 Phenomenon4) 25.72)
	(= (slew_time Phenomenon4 Star1) 94.37)
	(= (slew_time Star1 Phenomenon4) 94.37)
	(= (slew_time Phenomenon4 GroundStation2) 27.32)
	(= (slew_time GroundStation2 Phenomenon4) 27.32)
	(= (slew_time Phenomenon4 Star3) 74.81)
	(= (slew_time Star3 Phenomenon4) 74.81)
	(= (slew_time Phenomenon5 GroundStation0) 35.55)
	(= (slew_time GroundStation0 Phenomenon5) 35.55)
	(= (slew_time Phenomenon5 Star1) 32.23)
	(= (slew_time Star1 Phenomenon5) 32.23)
	(= (slew_time Phenomenon5 GroundStation2) 76.55)
	(= (slew_time GroundStation2 Phenomenon5) 76.55)
	(= (slew_time Phenomenon5 Star3) 18.27)
	(= (slew_time Star3 Phenomenon5) 18.27)
	(= (slew_time Phenomenon5 Phenomenon4) 11.83)
	(= (slew_time Phenomenon4 Phenomenon5) 11.83)
	(= (slew_time Planet6 GroundStation0) 24.47)
	(= (slew_time GroundStation0 Planet6) 24.47)
	(= (slew_time Planet6 Star1) 2.033)
	(= (slew_time Star1 Planet6) 2.033)
	(= (slew_time Planet6 GroundStation2) 61.59)
	(= (slew_time GroundStation2 Planet6) 61.59)
	(= (slew_time Planet6 Star3) 28.8)
	(= (slew_time Star3 Planet6) 28.8)
	(= (slew_time Planet6 Phenomenon4) 25.29)
	(= (slew_time Phenomenon4 Planet6) 25.29)
	(= (slew_time Planet6 Phenomenon5) 62.36)
	(= (slew_time Phenomenon5 Planet6) 62.36)
	(= (slew_time Planet7 GroundStation0) 19.34)
	(= (slew_time GroundStation0 Planet7) 19.34)
	(= (slew_time Planet7 Star1) 40.54)
	(= (slew_time Star1 Planet7) 40.54)
	(= (slew_time Planet7 GroundStation2) 23.08)
	(= (slew_time GroundStation2 Planet7) 23.08)
	(= (slew_time Planet7 Star3) 68.97)
	(= (slew_time Star3 Planet7) 68.97)
	(= (slew_time Planet7 Phenomenon4) 53.64)
	(= (slew_time Phenomenon4 Planet7) 53.64)
	(= (slew_time Planet7 Phenomenon5) 13.97)
	(= (slew_time Phenomenon5 Planet7) 13.97)
	(= (slew_time Planet7 Planet6) 60.54)
	(= (slew_time Planet6 Planet7) 60.54)
	(= (slew_time Phenomenon8 GroundStation0) 15.85)
	(= (slew_time GroundStation0 Phenomenon8) 15.85)
	(= (slew_time Phenomenon8 Star1) 61.78)
	(= (slew_time Star1 Phenomenon8) 61.78)
	(= (slew_time Phenomenon8 GroundStation2) 53.16)
	(= (slew_time GroundStation2 Phenomenon8) 53.16)
	(= (slew_time Phenomenon8 Star3) 66.04)
	(= (slew_time Star3 Phenomenon8) 66.04)
	(= (slew_time Phenomenon8 Phenomenon4) 0.2765)
	(= (slew_time Phenomenon4 Phenomenon8) 0.2765)
	(= (slew_time Phenomenon8 Phenomenon5) 0.003284)
	(= (slew_time Phenomenon5 Phenomenon8) 0.003284)
	(= (slew_time Phenomenon8 Planet6) 10.26)
	(= (slew_time Planet6 Phenomenon8) 10.26)
	(= (slew_time Phenomenon8 Planet7) 14.59)
	(= (slew_time Planet7 Phenomenon8) 14.59)
	(= (slew_time Planet9 GroundStation0) 62.13)
	(= (slew_time GroundStation0 Planet9) 62.13)
	(= (slew_time Planet9 Star1) 15.76)
	(= (slew_time Star1 Planet9) 15.76)
	(= (slew_time Planet9 GroundStation2) 10.5)
	(= (slew_time GroundStation2 Planet9) 10.5)
	(= (slew_time Planet9 Star3) 55.53)
	(= (slew_time Star3 Planet9) 55.53)
	(= (slew_time Planet9 Phenomenon4) 11.56)
	(= (slew_time Phenomenon4 Planet9) 11.56)
	(= (slew_time Planet9 Phenomenon5) 5.337)
	(= (slew_time Phenomenon5 Planet9) 5.337)
	(= (slew_time Planet9 Planet6) 47.62)
	(= (slew_time Planet6 Planet9) 47.62)
	(= (slew_time Planet9 Planet7) 36.6)
	(= (slew_time Planet7 Planet9) 36.6)
	(= (slew_time Planet9 Phenomenon8) 60.44)
	(= (slew_time Phenomenon8 Planet9) 60.44)
	(= (slew_time Star10 GroundStation0) 8.935)
	(= (slew_time GroundStation0 Star10) 8.935)
	(= (slew_time Star10 Star1) 27.86)
	(= (slew_time Star1 Star10) 27.86)
	(= (slew_time Star10 GroundStation2) 18.08)
	(= (slew_time GroundStation2 Star10) 18.08)
	(= (slew_time Star10 Star3) 33.59)
	(= (slew_time Star3 Star10) 33.59)
	(= (slew_time Star10 Phenomenon4) 5.085)
	(= (slew_time Phenomenon4 Star10) 5.085)
	(= (slew_time Star10 Phenomenon5) 7.743)
	(= (slew_time Phenomenon5 Star10) 7.743)
	(= (slew_time Star10 Planet6) 5.427)
	(= (slew_time Planet6 Star10) 5.427)
	(= (slew_time Star10 Planet7) 2.181)
	(= (slew_time Planet7 Star10) 2.181)
	(= (slew_time Star10 Phenomenon8) 19.81)
	(= (slew_time Phenomenon8 Star10) 19.81)
	(= (slew_time Star10 Planet9) 57.02)
	(= (slew_time Planet9 Star10) 57.02)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon4 infrared0)
	(have_image Phenomenon5 infrared0)
	(have_image Planet6 image1)
	(have_image Planet7 image1)
	(have_image Planet9 image1)
	(have_image Star10 infrared0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 110 to 47.87, (fuel-used) from 0 to 62.13
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet7)
   changed: (fuel satellite0) from 47.87 to 28.53, (fuel-used) from 62.13 to 81.47
   goals met: 0 of 6
5. (take_image satellite0 planet7 instrument0 image1)
   added: (have_image planet7 image1)
   changed: (data_capacity satellite0) from 1000 to 800, (data-stored) from 0 to 200
   goals met: 1 of 6
6. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 28.53 to 26.349, (fuel-used) from 81.47 to 83.651
   goals met: 1 of 6
7. (take_image satellite0 star10 instrument0 infrared0)
   added: (have_image star10 infrared0)
   changed: (data_capacity satellite0) from 800 to 764, (data-stored) from 200 to 236
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon4 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 26.349 to 21.264, (fuel-used) from 83.651 to 88.736
   goals met: 2 of 6
9. (take_image satellite0 phenomenon4 instrument0 infrared0)
   added: (have_image phenomenon4 infrared0)
   changed: (data_capacity satellite0) from 764 to 760, (data-stored) from 236 to 240
   goals met: 3 of 6
10. (turn_to satellite0 phenomenon8 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 21.264 to 20.9875, (fuel-used) from 88.736 to 89.0125
   goals met: 3 of 6
11. (turn_to satellite0 phenomenon5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 20.9875 to 20.9842, (fuel-used) from 89.0125 to 89.0158
   goals met: 3 of 6
12. (turn_to satellite0 planet9 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 20.9842 to 15.6472, (fuel-used) from 89.0158 to 94.3528
   goals met: 3 of 6
13. (take_image satellite0 planet9 instrument0 image1)
   added: (have_image planet9 image1)
   changed: (data_capacity satellite0) from 760 to 569, (data-stored) from 240 to 431
   goals met: 4 of 6
14. (turn_to satellite0 phenomenon5 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 15.6472 to 10.3102, (fuel-used) from 94.3528 to 99.6898
   goals met: 4 of 6
15. (take_image satellite0 phenomenon5 instrument0 infrared0)
   added: (have_image phenomenon5 infrared0)
   changed: (data_capacity satellite0) from 569 to 361, (data-stored) from 431 to 639
   goals met: 5 of 6
16. (turn_to satellite0 phenomenon8 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 10.3102 to 10.3069, (fuel-used) from 99.6898 to 99.6931
   goals met: 5 of 6
17. (turn_to satellite0 planet6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 10.3069 to 0.046932, (fuel-used) from 99.6931 to 109.953
   goals met: 5 of 6
18. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   changed: (data_capacity satellite0) from 361 to 183, (data-stored) from 639 to 817
   goals met: 6 of 6
